
import 'package:flutter/material.dart';

class quwat extends StatelessWidget {


  @override
  Widget build(BuildContext context) {

    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text('قوت ایمان'),
        backgroundColor: Colors.teal,
      ),
      body:SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,
          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 1750,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 15 , right: 6),
                  child: Text(
                      'ایمان به خدای بزرگ و بلندمرتبه پس از توفیق و خواست الهی عامل بازدارنده‌ی انسان از دچارشدن به منجلاب گناه است، مگر نه اینست که رسول خدا ج فرموده است: «لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ»( ). یعنی: «زناکار هنگام ارتکاب عمل زنا مؤمن نیست».'
                      'از این رو هرگاه ایمان در قلبت جای بگیرد و دلت و تمام وجودت را فرا بگیرد، دیگر به خواست خدای متعال در انجام گناهان گستاخ نخواهی بود''.'
                      'ایمان شخص مؤمن را از ارتکاب حرام باز می‌دارد و در قلبش چنان لذت و حلاوتی می‌نهد که لذایذ جنسی هرگز با آن برابری نمی‌کند. آری!'' ایمان قلب را به گونه‌ای آکنده از محبت خدای متعال می‌گرداند که در قلب تنها محبت خدا و محبت آنچه خدا دوست دارد، می‌ماند.'' قطعاً تفاوت بسیاری میان محبت و دل‌دادگی به خدا و میان هوا و هوس و شیفتگی به مخلوق وجود دارد و کسی که لذت ایمان را نچشیده نمی‌تواند این تفاوت را دریابد و یا آن را بپذیرد.'' به هرحال ایمان بنده را در پناه و حمایت خدا درمی‌آورد و او را از چیرگی شیطان محافظت می‌کند، چنانکه خدای متعال فرموده است:'
                  '﴿إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ٩٩ إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ١٠٠﴾' '[النحل: 99-100].'
                  '«بی‌گمان شیطان بر کسانی که ایمان دارند و بر پروردگارشان توکل می‌نمایند، هیچگونه تسلطی ندارد، بلکه تسلط شیطان تنها بر کسانی است که شیطان را به دوستی می‌گیرند و به واسطه‌ی او به خدا شرک می‌ورزند»''.'
                  'هم‌چنین فرموده است:'
                  '﴿إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِينَ٤٢﴾ [الحجر: 42].'
                  '«بی‌گمان تو' '(''ای شیطان)!' 'هیچگونه تسلط و قدرتی بر بندگان من نداری، مگر آن گمراهانی که' '(به وسوسه‌ی تو گوش فرا دهند و) به دنبال راه تو بیفتند».'
                  'مؤمن اگر گناهی هم بکند، خیلی زود به خود می‌آید، چنانچه خدای متعال در توصیف بندگان مؤمنش فرموده است:'
                  '﴿إِنَّ ٱلَّذِينَ ٱتَّقَوۡاْ إِذَا مَسَّهُمۡ طَٰٓئِفٞ مِّنَ ٱلشَّيۡطَٰنِ تَذَكَّرُواْ فَإِذَا هُم مُّبۡصِرُونَ٢٠١﴾ [الأعراف: 201].'
              '«پرهیزگاران هنگامی که گرفتار وسوسه‌ای از شیطان می‌شوند، به یاد' '(''عداوت و نیرنگ شیطان و مجازات پروردگار)'' می‌افتند (و در پرتو یاد خدا و به یادآوردن دشمنی شیطان) بینا می‌گردند و آگاه می‌شوند».'
      'ای خواهر و برادر گرامی! از خدا بخواهیم که همه‌ی ما را در پناه و حمایت خویش قرار دهد؛ بنابراین، سعی کنیم تا بذر ایمان را در دل‌هایمان حفظ کنیم؛ چرا که ثمره‌ی رشد بذر ایمان، سعادت دنیا و آخرت است',


                    style: TextStyle(
                      fontFamily: 'Tajawal',
                      fontSize: 17,
                      color: Colors.black,
                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );

  }
}