
import 'package:flutter/material.dart';

class Rahnamod extends StatelessWidget {


  @override
  Widget build(BuildContext context) {

    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text('رهنمود رسول خدا صلی الله علیه وسلم'),
        backgroundColor: Colors.teal,
      ),
      body:SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,
          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 3500,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 15 , right: 6),
                  child: Text(
                    'رسول اکرم صلی الله علیه وسلم حق هرچندی را ادا کرده و برای امت به تمام و کمال خیرخواهی نموده است. از این رو امکان ندارد که مسأله‌ی ازدواج یا کنترل غرایز جنسی را بی‌پاسخ گذاشته باشد، اصلاً ممکن نیست که آن حضرت صلی الله علیه وسلم نیکی و خیری را وا گذاشته و به آن راهنمایی نکرده باشد و یا بدی و شری را بدون رهنمود رها کرده باشد. بنابراین، رسول اکرم صلی الله علیه وسلم به بیان چگونگی کنترل غرایز جنسی پرداخته و فرموده است: «يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ البَاءَةَ فَلْيَتَزَوَّجْ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ»( ). یعنی: «ای جوانان! هرکس از شما که توانایی ازدواج دارد، ازدواج نماید و کسی که توانایی ازدواج ندارد، روزه بگیرد؛ چرا که روزه شهوت را کنترل می‌کند».'
                    'آری! این رهنمود کسی است که از بیماری‌ها و نیازمندی‌های جسم و روان انسان آگاه است''.'
                  'خیلی جدی برای ازدواج‌کردن تصمیم بگیر و از فقر و نداری نترس و بدان که خدای متعال تو را یاری می‌نماید؛ چرا که هیچکس بهتر از خدا به وعده‌اش عمل نمی‌کند''. خدای متعال می‌فرماید:'
                      '﴿وَلۡيَسۡتَعۡفِفِ ٱلَّذِينَ لَا يَجِدُونَ نِكَاحًا حَتَّىٰ يُغۡنِيَهُمُ ٱللَّهُ مِن فَضۡلِهِۦ﴾ [النور: 33].'
                      '«آنان که امکانات ازدواج را ندارند' '(و قادر به پرداخت مهریه و تأمین نفقه نیستند'')'' باید در راه عفت و پاکدامنی تلاش نمایند تا خداوند از فضل و لطف خود آنان را دارا نماید».'
                    'پیامبر اکرم صلی الله علیه وسلم خبر داده است که هرکس با نیت درست ازدواج نماید، خدای متعال نیز او را یاری می‌رساند. ابوهریره (رض) می‌گوید: رسول خدا صلی الله علیه وسلم فرمود:'' «ثَلَاثَةٌ حَقٌّ عَلَى اللَّهِ عَوْنُهُمْ:'' المُجَاهِدُ فِي سَبِيلِ اللَّهِ، وَالمُكَاتَبُ الَّذِي يُرِيدُ الأَدَاءَ، وَالنَّاكِحُ الَّذِي يُرِيدُ العَفَافَ»( ). یعنی: «سه نفر سزاوار یاری خدا هستند:'' مجاهدی که در راه خدا جهاد می‌کند؛ برده‌ای که اجازه یافته تا با ادای پول، خود را آزاد کند و او قصد ادای پول آزادیش را دارد و کسی که از طریق ازدواج خواهان عفت و پاک‌دامنی است».'
              'از شما خواهر گرامی می‌خواهم که هرچه زودتر به خواستگار نیک و شایسته پاسخ مثبت بدهی، زیرا درنگ‌کردن مخالف سنت و زمینه‌ی فساد می‌باشد و حتی ممکن است که باعث شود دختر سرانجام به ازدواج با کسی تن دهد که او را دوست ندارد.'
             ' ازدواج به زن و مرد این امکان را می‌دهد که نیاز جنسی خود را بی‌آن که مرتکب گناه و معصیت شوند، از راه حلال و شرعی برآورده سازند و بلکه سزاوار اجر و پاداش نیز بشوند''.'' ابوذر س از رسول اکرم ج چنین روایت کرده است: «وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ» یعنی:'' «در همبستری هریک از شما با همسرش (ثواب) صدقه‌ای است». صحابه (رض) عرض کردند:‌ای رسول خدا!'' چگونه امکان دارد که یکی از ما برآورده‌کردن شهوتش اجر و پاداش بیابد؟!'' رسول خدا صلی الله علیه وسلم فرمود: «أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ فِيهَا وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أَجْرٌ»( ). یعنی:'' «آیا اگر شهوتش را از راه حرام برآورده نماید، او را گنهکار نمی‌دانید؟ همین طور اگر شهوتش را از راه حلال برآورده نماید، برای او اجر و پاداشی خواهد بود».'
   ' عبدالمؤمن مغربی می‌گوید: انسان مجرد همانند فردی است که کفش ندارد''. مجردبودن کلید و دروازه‌ی زناست و ازدواج دام ثروت و توانگری می‌باشد، کسی که ازدواج می‌کند، برخی از شیاطینش را به بند می‌کشد و نصف دینش را در حفاظت و مصونیت قرار می‌دهد و باید در باره‌ی نصف دیگر دینش از خدا بترسد، خرابی و تباهی دینداری برخاسته از دو شهوت است'': یکی شهوت کوچک که همان شهوت شکم است و دیگری شهوت بزرگ که شهوت جنسی می‌باشد''. از این رو مراقب این دو گودال باش و خود را از آن‌ها به خوبی محافظت کن''.'
    'اینک که بی‌بند و باری به اوج خود رسیده برخی از اندیشمندان غرب به ازدواج زودهنگام فرا می‌خوانند.'' چنانکه ول دیورانت ـ می‌گوید:'' «ما از آسیب‌های اجتماعی برخاسته از تأخیر در ازدواج بی‌خبریم و گویی این آسیب‌ها را نمی‌بینیم.'' بدون تردید برخی از این آسیب‌ها به عادات و عوامل افسار گسیخته‌ای برمی‌گردد که به آن رسیدگی نشده است.'' البته به گمان من بزرگ‌‌ترین عامل بروز آسیب‌های اجتماعی در دوران ما تأخیر غیر عادی در تشکیل خانواده می‌باشد، هم‌چنین باید دانست که بی‌بند و باری‌های پس از ازدواج نیز برخاسته از عادت‌های پیش از ازدواج است.'' متأسفانه بسیاری از اندیشمندان ما در تجزیه و تحلیل عوامل اجتماعی آزادی جنسی و حتی خودفروشی به عنوان یکی از مشاغل پررونق غرب به راحتی از کنار آن می‌گذرند و آن را فرایندی طبیعی و گریزناپذیر می‌پندارند.'' واقعاً مایه‌ی خجالت و شرمندگی است که چنین دیدگاهی را بپذیریم؛ چرا که افسار گسیختگی جنسی باعث شده تا نیم ملیون دختر آمریکایی خود را قربانی قتل‌گاه‌های بی‌بند و باری اخلاقی نمایند.'' افزون بر این که این امر باعث بی‌رغبتی مردان به ازدواج و زمینه‌ای برای برقراری روابط بی‌مهار آن‌ها با دختران هر زره‌ای شده که در کوچه و خیابان عرض اندام می‌کنند».'
   ' وی می‌افزاید:'' «انسان‌ها در گذشته خیلی زود ازدواج می‌کردند و همین راه کار مناسبی برای حل مشکلات جنسی بود.'' اما امروزه سن ازدواج بالا رفته و از این رو بسیاری از افراد بارها حلقه‌ی نامزدی خود را عوض می‌کنند.'' دولت‌هایی که قوانینی را برای تسهیل در امر ازدواج تصویب می‌کنند، موفق و قابل تقدیر می‌باشند.'' چرا که فراهم‌نمودن بستر ازدواج یکی از بزرگ‌‌ترین راه کارهای رسیدگی به مشکلات جنسی در عصر حاضر می‌باشد».'
    'خوبست دختران و پسران جوان هرچه زودتر ازدواج نمایند و خودشان را از ناپاکی‌های رو به رشد، حفاظت کنند.'' عفت و پاک‌دامنی آنقدر ارزش دارد که انسان برای آن هزینه‌های زیادی بپردازد'

                    '\n'
                    '\n'
                    '\n'
                    '....................................'
                    '\n'
                    ' . رواه مسلم (1006)-',

                    style: TextStyle(
                      fontFamily: 'Tajawal',
                      fontSize: 17,
                      color: Colors.black,
                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );


  }
}