
import 'package:flutter/material.dart';

class Roza extends StatelessWidget {


  @override
  Widget build(BuildContext context) {

    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text('روزه'),
        backgroundColor: Colors.teal,
      ),
      body:SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,
          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 1000,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 15 , right: 6),
                  child: Text(
                      'برای جوانانی که توانایی ازدواج ندارند و برایشان شرایط ازدواج فراهم نیست، راه کار دیگری نیز وجود دارد، آن‌ها باید روزه بگیرند. چرا به این نمی‌اندیشید که سه روز در ماه یا روزهای دوشنبه و پنجشنبه را روزه بگیرید؟ حال آنکه بنابر فرموده‌ی رسول الله صلی الله وسبم روزه سپر و نگهدارنده‌ی مؤمن از آتش جهنم است( ). علاوه براین، روزه اجر و ثواب زیادی نیز دارد. چنانکه رسول خدا صلی الله علیه وسلم می‌گوید: خدای متعال می‌فرماید:'
                      '«كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ، إِلَّا الصِّيَامَ، فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ»''( ). یعنی: «هر عملی که فرزند آدم انجام دهد، برای خودش می‌باشد، جز روزه که مخصوص من است و خودم پاداش آن را خواهم داد»''.'
                'خدای متعال روزه راه زمینه‌ی تحقق تقوا و خداترسی دانسته و فرموده است:'
                '﴿يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُتِبَ عَلَيۡكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُونَ١٨٣﴾' '[البقرة: 183].'
                '«ای کسانی که ایمان آورده‌اید!'' بر شما روزه واجب شده است، همانگونه که بر پیشینیان شما واجب بوده است تا باشد که پرهیزگار شوید».'
                'روزه افزون برآنکه انسان را از دنباله‌روی شهوت باز می‌دارد و پاداش زیادی هم دارد، اراده و صبر و تحمل آدمی را نیز افزایش می‌دهد و باعث چیرگی انسان بر لذت‌ها و خواسته‌های نفسانی می‌گردد''. از این رو از شما خواهر و برادر گرامی می‌خواهم که به اندازه‌ی توانایی خود هر از چند گاهی روزه بگیرید'

                    '\n'
                    '\n'
                       '.................................'
                    '\n'
                    ' - (رواه النسائی (2231) و ابن ماجه (1639) وأصله فی الصحیحین).'
                      '- رواه البخاری (1904) و مسلم (1151)',

                    style: TextStyle(
                      fontFamily: 'Tajawal',
                      fontSize: 17,
                      color: Colors.black,
                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );


  }
}