
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class kodamin extends StatelessWidget {


  @override
  Widget build(BuildContext context) {

    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text('کدامین محبت را بر می گزینی؟'),
        backgroundColor: Colors.teal,
      ),
      body:SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,
          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 7000,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 16 , right: 5),
                  child: Text(''
                     'قلب انسان به سان ظرفی است که همواره محبت محبوبی را در خود دارد که به او وابسته می‌باشد و یا در هراس است که مبادا او را از دست بدهد. هم‌چنین دو چیز ضد و عکسِ هم یکجا گرد نمی‌آیند؛ از این رو آیا می‌پنداری که اگر قلبت آکنده از شهوت و هوای نفس باشد، دیگر جایی برای محبت خدا و آنچه خدا دوست دارد، می‌ماند؟ بی‌گمان یکی را باید برگزید؛ اگر محبت خدا و لذت ایمان را می‌خواهی چاره‌ای جز این نداری که قلب را از هرآنچه که مایه‌ی ناخشنودی خداست پاک نمایی، چرا که اگر دل به غیر خدا ببندی، نمی‌توانی لذت ایمان و شیرینی عبادت را بچشی.'
                  'پیروان هوای نفس به بندگان و اسیران نفس خویش تبدیل می‌شوند و بی‌اراده از خواسته‌های نفسانی خود اطاعت می‌کنند و در برابر امر و نهی از خود هیچ اختیاری ندارند''. ابن قیم / به بیان ویژگی‌های این افراد پرداخته و گفته است'': «اگر به چنین فردی اختیار داده شود که رضای معشوق یا رضای خدا را برگزیند، رضای معشوقش را بر رضای خدا ترجیح می‌دهد و بیش از آنکه مشتاق دیدار خدا باشد، واله و شیفته‌ی دیدار معشوقش هست و بیش‌تر از آنکه بخواهد به خدا نزدیک شود، آرزوی نزدیکی به معشوق را در سر می‌پروراند؛ هم‌چنین از ناخرسندی معشوقش بیش از خشم خدا گریزان است و حتی برای جلب رضایت معشوقش حاضر است خدا را هم ناراض کند''. آری! این افراد خواسته‌ها و نیازهای معشوق را بر اطاعت و بندگی خدا ترجیح می‌دهد و اگر ذره‌ای ایمان داشته باشد و فرصتی هم بیابد، آن وقت شاید کاری برای اطاعت خدا بکند؛ البته اگر برآورده‌ساختن خواسته‌ها و نیازهای معشوق تمام فرصتش را هم بطلبد، او وقتش را در آن صرف خواهد کرد و از انجام دستورات الهی غافل خواهد ماند''. بله، این فرد حاضر است تمام ارزش‌ها و داشته‌های گران‌ بهایش را به پای معشوق بریزد و اگر بخواهد چیزی برای خدا بدهد، از داشته‌ها و داریی‌های پست و بنجلش می‌دهد و چرا چنین نباشد که همه چیزش از معشوقش می‌باشد؟''! قلبش، عقلش، وقتش، مالش و تمام فکر و خیالش از آنِ معشوق است و بس؛ گویا ''[نعوذ بالله] خدا اضافی است و کاملاً بی‌خیالِ او شده و یادش را فراموش کرده است؛ اگر در پیشگاه خدا به نماز بایستد به زبان با خدا راز و نیاز می‌کند و به دل در یاد معشوق است''! رویش به سوی قبله است و دل به سوی معشوق دارد''! از ایستادن در پیشگاه الهی گریزان است و هنگامی که به نماز می‌ایستد، گویی بر روی آتش ایستاده و بی‌قرار است که هرچه زودتر نمازش را تمام کند''! امام اگر در خدمت معشوقش حضور یابد، با تمام وجود و با حضور قلب در برابر معشوقش می‌ایستد؛ از ایستادن در حضور معشوق هرچند هم که به درازا بکشد احساس خستگی که نمی‌کند هیچ شادمان و مسرور نیز هست»''( ).'
                   ' در این باره نیازی به آوردن دلیل و مصداق نیست و اشعار و عبارات اینگونه افراد گواه روی کردشان در قبال معشوقشان می‌باشد؛ هم‌چنین برای درک بیش‌تر این موضوع کافی است به احوال عاشقان خود باخته بنگرید و توجه نمایید که چگونه عشق و دل‌باختگی شوم، آنان را از خود بی‌خود کرده است؟ اصلاً آیا چنین دل‌دادگی و عشقی آنقدر ارزش دارد که انسان تمام زندگیش را در آن منحصر و مختصر نماید؟''!.'
                'آیا تا کنون چیزی از بیماری‌های جنسی شنیده‌اید؟'
                'یکی از سنت‌ها و قوانین الهی این است که گاهی در همین دنیا نیز نافرمانان را مجازات می‌کند، در این پهنه فحشاگران و زناکاران مجازات ویژه‌ی خود را دارند''. عبدالله بن عمرو بن عاص س می‌گوید'': رسول خدا صلی الله علیه وسلم فرموده است: «لَـمْ تَظْهَرِ الْفَاحِشَةُ فِي قَوْمٍ قَطُّ، حَتَّى يُعْلِنُوا بِهَا، إِلَّا فَشَا فِيهِمُ الطَّاعُونُ، وَالْأَوْجَاعُ الَّتِي لَمْ تَكُنْ مَضَتْ فِي أَسْلَافِهِمُ الَّذِينَ مَضَوْا''...»( ). یعنی: «بدکاری و فساد جنسی در هیچ قوم (و'
                    '\n'
                        '\n'
                        '\n'
                  '....................................................................'
                      '\n'
                    ' - إغاثة اللهفان، ج 2، ص 151 - 152.'
                     ' - روایت ابن ماجه، به شماره‌ی 4019؛ آلبانی نیز این حدیث را در سلسة الأحادیث الصحیحة ''(شماره‌ی 106) آورده و آن را صحیح دانسته است. در این حدیث به عقوبت و مجازات دنیوی پنج عمل اشاره شده است'': 1- پیدایش و گسترش بیماری‌های ناشناخته و بی‌سابقه در نتیجه‌ی رواج و گسترش بی‌بند و باری اخلاقی و فساد جنسی''. 2- تنگنای زندگانی و جور و ستم حکام در نتیجه‌ی خیانت‌کاری در کیل و ترازو''. 3- قحطی و خشکی در نتیجه‌ی امتناع'
                    '\n'
                        '\n'
                        '\n'
                      '\n'
                         'جامعه‌ای) به طور آشکار پدیدار نمی‌گردد، مگر آنکه طاعون و بیماری‌هایی در میانشان شیوع می‌یابد که در میان پیشینیان‌شان سابقه نداشته است».'
                  'آیا تا کنون چیزی از بیماری زهری و سوزاک شنیده‌اید؟ آمار پزشکی حاکی از آن است که در سال' '1977 میلادی پنجاه میلیون نفر به بیماری زهری مبتلا بوده‌اند. این در حالی است که تعداد مبتلایان به بیماری سوزاک پنج برابر یعنی 250 میلیون نفر بوده است. در سال 1981 میلادی فقط رقم مبتلایان به بیماری هرپس تناسلی در آمریکا به 20 ملیون نفر رسیده است.'
                 ' آری! خدای متعال برخی از نافرمانان را به طاعون سیاه قرن یعنی ایدز مبتلا می‌نماید و بدین‌سان آمار مبتلایان به این بیماری با رشدی تصاعدی همراه است؛ چنانچه تعداد افرادی که روزانه ویروس این بیماری به آنان انتقال می‌یابد، ''10 هزار نفر می‌باشد؛ این بیماری در هردقیقه به 6 کودک زیر پنج سال نیز سرایت می‌کند. در سال 2000 م نزدیک به 3 میلیون بیمار ایدزی وفات نمودند. هم‌چنین ایدز، 2/ 13 میلیون کودک به لیست یتیمان ایدز، در سال 2000 م به 4/ 34 میلیون نفر رسیده که بیش از 33 % آن‌ها نوجوانان و جوانان 15 تا 24 ساله هستند( ). البته باید دانست که 73 %'' مبتلایان به بیماری ایدز از هم‌جنس‌بازان و کسانی می‌باشند که عمل قوم لوط را انجام می‌دهند.'
               ' یکی از بازیگران سینمای آمریکا به نام روک هدسون در بستر مرگ و در حال دست و پنجه نرم‌کردن با بیماری ایدز می‌گوید'': «من منتظر سرنوشت خود هستم و هر لحظه انتظار می‌کشم که مرگ دربِ خانه‌ام را بزند؛ من صدای مرگ را از اعماق وجودم می‌شنوم؛ من دوست ندارم که این طور عذاب شوم؛ الآن که من به سرطان قرن مبتلا شده‌ام و به رغم این که بسیاری سعی می‌کنند با خنده و لبخند به '
                         '\n'
                          '\n'
                          '\n'
                            '...................................................................'
                           '\n'
                     'از ادای زکات. 4- سیطره‌ی دشمن بیگانه در نتیجه‌ی عهدشکنی با خدا و رسول. 5- جنگ و درگیری داخلی در نتیجه‌ی عدم اجرای دستورات و قوانین الهی از سوی حکام.'
                    '- رجوع کنید به: ضمیمه‌ی سالانه‌ی مجله‌ی البیان در سال 1422 هـ ق'
                      '\n'
                      '\n'
                      '\n'
                    'من دل گرمی و امید بهبودی بدهند، باز هم انتظار سرنوشتم را می‌کشم و می‌دانم که مرگ به زودی به سراغم می‌آید و درب خانه‌ام را می‌زند»( ).'
                  'شاید بسیار شنیده باشید که جوانی در خارج از کشورش با دختری رابطه‌ی جنسی داشت و چون قصد بازگشت به کشورش را نمود، کاغذی دید که آن دختر رویش نوشته بود'': «از این که عضو باشگاه ایدزی‌ها شدی، به تو تبریک می‌گویم»''. جوان بیچاره به اندازه‌ای ناراحتی و اندوهگین شد که هوش از سرش رفت، به هرحال‌ای خواهر و‌ای برادر گرامی''! از خدای متعال می‌خواهیم که شما را از قرارگرفتن در چنین راهی حفظ کند.'
                  'این یک سنت و قانون الهی است که مجازات هرعملی متناسب با نوع و جنس عمل می‌باشد، بی‌گمان کسی که افسار گسیخته و بدون هیچ قید و بندی گام در مسیر شهوت و هوس خویش می‌نهد، از مجازات الهی مصون نخواهد ماند و بنابر قانون و سنت الهی بخش اندکی از عقوبت و فرجام کردار بدش را در همین دنیا خواهد دید''. کسی که نسبت به ریختن آبروی دیگران بی‌باک شده، در معرض آبروریزی دختر و خواهرش نیز قرار گرفته است؛ همین‌طور کسی که نسبت به محارم الهی بی‌پروا گشته، بعید نیست که با خیانت همسرش رو برو گردد؛ اصلاً گستاخی و بی‌پروایی در بدکاری، سبب می‌شود که دختران و یا سلاله‌ی انسان به بدی و بدکاری دچار شوند، چرا که گاهی انسان به عقوبتی همانند کرداری که انجام داده مبتلا می‌گردد و با نزدیکانش همان کاری می‌شود که او با دیگران کرده است''. از این رو‌ای خواهر و برادر گرامی''!''بیایید تا فکر آبرویمان را بکنیم و از خدا بخواهیم که ما را از ابتلا به مسایلی این چنین ناگوار مصون بفرماید'

                    '\n'
                        '\n'
                        '\n'
                        '........................................................'
                      '\n'
                    ' - نگاه کنید به کتاب: «غضب الله تعالى يلا حق الـمتمردين على الفطرة، نوشته‌ی فؤاد سید الرفاعی',
                    style: TextStyle(
                      fontFamily: 'NotoNastaliqUrdu',
                      fontSize: 20,
                      color: Colors.black,
                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );


  }
}