
import 'package:flutter/material.dart';

class payamadhai extends StatelessWidget {


  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text('پیامدهای ناگوار پیروی از تمایلات جنسی'),
        backgroundColor: Colors.teal,
      ),
      body:SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,
          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 11100,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 18 , right: 8),
                  child: Text(''
                      'خدای متعال در قرآن کریم از عذاب دردناک و شدید بدکاران در روز قیامت خبر داده است؛ اینک بنگر که آیا تاب و توان تحمل عذاب دردناک آخرت را داری؟! خداوند متعال می‌فرماید:'
                  '﴿وَٱلَّذِينَ لَا يَدۡعُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ وَلَا يَقۡتُلُونَ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّ وَلَا يَزۡنُونَۚ وَمَن يَفۡعَلۡ ذَٰلِكَ يَلۡقَ أَثَامٗا٦٨ يُضَٰعَفۡ لَهُ ٱلۡعَذَابُ يَوۡمَ ٱلۡقِيَٰمَةِ وَيَخۡلُدۡ فِيهِۦ مُهَانًا٦٩﴾ [الفرقان: 68-69].'
                  '«و کسانی که با الله معبود دیگری را به فریاد نمی‌خوانند و پرستش نمی‌نمایند و انسانی را که خداوند خونش را حرام گردانیده است، نمی‌کشند مگر به حق، و زنا نمی‌کنند و هرکس (یکی از) این (کارهای ناشایست)'' را انجام دهد، کیفر آن را می‌بیند؛ عذاب او در قیامت مضاعف می‌گردد و خوار و ذلیل برای همیشه در عذاب می‌ماند».'
                  'اصلاً آیا کسی می‌تواند در برابر عذاب الهی تاب بیاورد؟!'' افزون بر این باید دانست که زنان و مردان زناکار پیش از برپایی قیامت در قبر نیز عذاب می‌شوند.'' رسول خدا ج به بخشی از عذاب این‌ها در قبر اشاره کرده و به توصیف مواردی از عذاب مردان و زنان زناکار پرداخته که با چشم خود مشاهده کرده است.'' این حدیث طولانی است و ما آن قسمت از حدیث را می‌آوریم که با موضوع مورد بحث در ارتباط است.'' پیامبر اکرم صلی الله علیه وسلم در بخشی از این حدیث می‌فرماید:'' «فَانْطَلَقْنَا إِلَى ثَقْبٍ مِثْلِ التَّنُّورِ، أَعْلاَهُ ضَيِّقٌ وَأَسْفَلُهُ وَاسِعٌ يَتَوَقَّدُ تَحْتَهُ نَارًا، فَإِذَا اقْتَرَبَ ارْتَفَعُوا حَتَّى كَادَ أَنْ يَخْرُجُوا، فَإِذَا خَمَدَتْ رَجَعُوا فِيهَا، وَفِيهَا رِجَالٌ وَنِسَاءٌ عُرَاةٌ»( ). یعنی:'' «به راه خود ادامه دادیم تا این که به خندقی رسیدیم که مانند تنور بود؛ دهانه‌اش تنگ و بخش پایینی آن وسیع بود و زیر آن آتشی برافروخته زبانه می‌کشید.'' عده‌ای از مردان و زنان لخت و برهنه در گودال بودند؛ هرگاه آتش زبانه می‌کشید، آنان طوری بالا می‌آمدند که نزدیک بود از دهانه‌ی خندق بیرون بیایند و چون آتش فروکش می‌کرد، آنان نیز در خندق فرو می‌رفتند».'
      'این بخشی از عذاب الهی است که زناکاران با آن روبرو می‌شوند، کسانی که کرده‌ی بدقوم لوط را انجام می‌دهند' '(هم‌جنس بازان)'' نیز اگر عذاب سخت‌تری نداشته باشند، حداقل همانند دیگر زناکاران عذاب خواهند شد، چه کسی طاقت چنین عذابی را دارد و اصلاً کدامین عاقل خود را در معرض چنین عذابی قرار می‌دهد؟!.'
    ':دختران و پسران جوانی که از بلای بدکاری مصون مانده‌اند، باید بدانند که نگاه، سلام و دیگر موارد این چنینی مقدمه و گام نخست در راه بدکاری و هلاکت است و ادامه‌دادن چنین مقدماتی شخص را به پسامدهایی هم چون زنا و روابط نامشروع می‌کشاند، شیطان در برابر خدای متعال سوگند یاد کرده که برای فریب بندگان خدا از هرراهی که بیابد تلاش نماید'
    '﴿قَالَ فَبِمَآ أَغۡوَيۡتَنِي لَأَقۡعُدَنَّ لَهُمۡ صِرَٰطَكَ ٱلۡمُسۡتَقِيمَ١٦ ثُمَّ لَأٓتِيَنَّهُم مِّنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ وَعَنۡ أَيۡمَٰنِهِمۡ وَعَن شَمَآئِلِهِمۡۖ وَلَا تَجِدُ أَكۡثَرَهُمۡ شَٰكِرِينَ١٧﴾' '[الأعراف: 16-17].'
        '«(شیطان) گفت: بدان سبب که مرا گمراه ساختی، من بر سر راه مستقیم تو در کمین آنان می‌نشینم (و با هروسیله‌ی ممکن برای گمراه‌کردن آن‌ها می‌کوشم)'' سپس از پیش رو و از پشت سر و از طرف راست و از طرف چپ (و از هرطرف که بتوانم) به سراغ ایشان می‌روم و (''گمراهشان می‌کنم و از راه حق منحرفشان می‌نمایم تا بدانجا که'') .بیشتر آنان را سپاسگزار نخواهی یافت '

                      '\n'
                          '\n'
                          '\n'
                      '.........................................'
                          '\n'
                       '.روایت بخاری، حدیث (1386) -'
                      '\n'
                      '\n'
                      '\n'
                        'آری! شیطان هروسیله‌ای را برای منحرف‌کردن و فریب‌دادن بندگان خدا به کار می‌گیرد، زیرا شیطان می‌داند که اگر بنده‌ای را به گناهی هرچند کوچک دچار کند، قدمی به پیش رفته است و ادامه‌ی کارش برای فریب چنین بنده‌ای آسان‌تر خواهد بود، خداوند متعال در قرآن به بیان‌چرایی گریز کسانی پرداخته که از میدان جنگ در غزوه‌ی احد گریختند؛ در این آیه بیان شده که ابزار شیطان برای فریب‌فراریان احد در ماجرای فرار از جنگ و دچارنمودن آنان به این گناه بزرگ اعمال و کرده‌های خودشان بود. البته در این آیه تصریح می‌شود که خدای متعال از این گناه صحابه درگذشته و آنان را مورد بخشش خویش قرار داده است:'
                  '﴿إِنَّ ٱلَّذِينَ تَوَلَّوۡاْ مِنكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ إِنَّمَا ٱسۡتَزَلَّهُمُ ٱلشَّيۡطَٰنُ بِبَعۡضِ مَا كَسَبُواْۖ وَلَقَدۡ عَفَا ٱللَّهُ عَنۡهُمۡۗ إِنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ١٥٥﴾' '[آل عمران: 155].'
                  '«آنان که در روز رویارویی دو گروه (مسلمانان و کافران در جنگ احد)'' فرار کردند، بی‌گمان شیطان آنان را به سبب پاره‌ای از آنچه که کرده بودند، به لغزش انداخت و خداوند ایشان را بخشید؛ چرا که خداوند آمرزنده و شکیبا است».'
                    'شیطان می‌کوشد تا از هروسیله‌ای استفاده کند و انسان را به گناه صغیره مبتلا نماید و به تدریج او را به گناهان بزرگ و خیلی زشت بکشاند، وی همچنین پس از آنکه انسان را به بد‌ترین گناهان دچار نمود، او را به طرز دیگری می‌فریبد و می‌گوید:'' حالا که کارَت از زیان دنیا و آخرت گذشته، پس تا می‌توانی میل جنسی و هوای نفست را برآورده کن و به بدکاری‌هایت ادامه بده... شیطان بدین‌سان راه بازگشت را بر انسان گنهکار می‌بندد.'' اندکی تأمل در واقعیت‌های کنونی نشان می‌دهد که آغاز راه بیشتر دختران و پسران جوانی که به انحراف و گمراهی کشیده شده‌اند، پیروی از هوا و هوس و عدم خویشتن‌داری در برابر شهوت لجام گسیخته بوده است.'
                    'یکی دیگر از پیامدهای پیروی از هوای نفس سوء خاتمه و فرجام شوم است''.'' پیامبر اکرم ج از شخصی خبر داده که در زندگی فردی نیک و شایسته است، اما فرجام شوم و بدی دارد؛ ابن مسعود س می‌گوید:'' پیامبر راست‌گفتاری که مورد تصدیق واقع شده، برای ما چنین حدیث فرموده است که:'
                    '«إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يَبْعَثُ اللَّهُ إِلَيْهِ مَلَكًا بِأَرْبَعِ كَلِمَاتٍ، فَيُكْتَبُ عَمَلُهُ، وَأَجَلُهُ، وَرِزْقُهُ، وَشَقِيٌّ أَوْ سَعِيدٌ، ثُمَّ يُنْفَخُ فِيهِ الرُّوحُ، فَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الجـَنَّةِ فَيَدْخُلُ الجـَنَّةَ، وَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ الجـَنَّةِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، فَيَدْخُلُ النَّارَ»''( ). یعنی: «آفرینش هریک از شما بدین ترتیب است که ابتدا در شکم مادرش به مدت چهل روز فراهم می‌شود «و سلول‌های اولیه‌اش یعنی اسپرم پدر و اول مادر پیوند می‌خورند»( ). آنگاه در همان مدت به صورت لخته خونی درمی‌آید و سپس به همان ترتیب به شکل قطعه گوشتی جویده می‌گردد؛ سپس خداوند فرشته‌ای با چهار سخن به سوی آن می‌فرستد و بدانگاه عمل، اجل و رزقش و اینکه تیره‌روز است یا خوشبخت، نوشته می‌گردد و پس از آن در او روح دمیده می‌شود. چه بسا شخصی همواره عمل اهل جهنم را انجام می‌دهد تا آنکه میان او و جهنم جز به اندازه‌ی یک ذراع باقی نمی‌ماند، اما سرنوشت بر او پیشی می‌گیرد و (بدین‌سان) عمل اهل بهشت را انجام می‌دهد و وارد بهشت می‌شود و چه بسا شخصی همواره عمل بهشتیان را انجام می‌دهد؛ به گونه‌ای که میان او و بهشت جز به اندازه‌ی یک ذراع باقی نمی‌ماند، اما سرنوشت بر او پیشی می‌گیرد و (بدین‌سان) عمل اهل جهنم را انجام می‌دهد و وارد جهنم می‌شود».'
    'سلف صالح از سوء خاتمه بسیار می‌ترسیدند؛ چنانچه باری سفیان ثوری/ شب تا به صبح گریست. ''به او گفتند: آیا از گناهانت می‌گریی؟ سفیان کاهی از روی زمین برداشت و فرمود: «گناهان از'
                        '\n'
                      '\n'
                       '..........................................'
                     '\n'
                     ' - روایت بخاری، حدیث (3332)؛ روایت مسلم، حدیث (2643).'
                    '- عبارت داخل [] در ترجمه متن حدیث اضافه شد تا متن ترجمه روانتر و رساتر باشد. مترجم'
                    '\n'
                        '\n'
                      '\n'
                    'این کاه هم زبون‌تر و ناچیزتر است؛ من از ترس سوء‌خاتمه و فرجام بد می‌گریم».'
                    'دلبستگی و تعلق‌خاطر با شهوت‌ها و تمایلات جنسی و غلبه‌ی این‌ها بر قلب و دل انسان از مهم‌‌ترین عوامل فرجام بد می‌باشد، بدون تردید در ذهن و خاطر همه اندیشه‌هایی می‌گذرد که بر احساسات و عواطف او چیره می‌گردد؛ از این رو تمام فکر و خیال برخی از انسان‌ها پول و ثروت است؛ فکر و اندوه بعضی هم شهوت‌رانی و پاسخ‌گویی بی‌قید و بند به خواسته‌های جنسی است، البته هم و اراده‌ی عده‌ای نیز آخرت و سعادت همیشگی آن می‌باشد، چنین افرادی به حال و وضع امت و نیز کوتاهی‌های خود در این دنیا می‌اندیشند''.'' به هرحال انسان به هنگام مرگ به خود می‌آید و آنچه را که در طول زندگی بر فکر و اراده‌ی او مسلط بوده به یاد می‌آورد.'
                      'داستانی نقل شده که:'' شخصی به اندازه‌ای عاشق و دل‌باخته‌ی جوانی شده بود که سوز عشق و دل‌دادگی به آن جوان تمام قلبش را گرفته و او را مریض و بسترنشین کرده بود، آن جوان نیز از عاشق دل‌داده‌اش دوری می‌کرد، عده‌ای وساطت کردند و قرار شد که جوان به دیدن عاشق بیمار برود، عاشق بیچاره از شنیدن این خبر خشنود و شادمان گشت و اندوه دوری از معشوقش را از یاد برد و در انتظار نشست تا زمان دیدار فرا رسد؛ همچنان در انتظار بود که واسطه‌ی میان او و معشوق به نزدش رفت و گفت:'' آن جوان قسمتی از راه را با من آمد؛ اما از میانه‌ی راه بازگشت.'' عاشق بیچاره با شنیدن این خبر مات و مبهوت شد و وضعی بدتر از گذشته پیدا کرد.'' نشانه‌های مرگ در او پدیدار گشت، در آن حال این چنین گفته‌هایی بر زبان داشت که:'
                      'ويا شفاء الـمدنف النح رضاك أشهي إلى فؤادى'
                      'ـــيل أسلم يا راحة البال العليلمن رحمة الخالق الجليل'
                      'ترجمه: «ای کسی که مایه‌ی بهبودی این عاشق سخت‌زار و رنجور هستی و‌ای آنکه آسوده‌خاطر و بی‌خیالی''!'' با این عاشق زار و بیمار کنار بیا که من به قلب خویش خشنودی و خرسندی تو را بیش از رحمت خدا دوست دارم»!!.'
                      'به این شخص گفتند:'' از خدا بترس؛ هیچ می‌فهمی چه می‌گویی؟ آن عاشق بیچاره و ناکام گفت:'' واقعیت همین است که گفتم...'' مدت زمان زیادی نگذشت که فریاد و فغان مرگ آن بیچاره به گوش رسید.'
                      'هم‌چنین آورده‌اند.'
                      'شخصی کنار خانه‌اش ایستاده بود که دختری زیبا از آنجا گذشت و سراغ گرمابه را گرفت''. آن شخص خانه‌اش را نشان داد و گفت: حمام همین جاست.'' دختر وارد خانه شد و آن مرد نیز پشت سرش داخل خانه رفت.'' دختر که ماجرا را فهمید با خنده و ناز رو به آن مرد کرد و گفت: خوبست چیزی تهیه کنی که با در کنار هم‌بودن بیش‌تر لذت ببریم.'' آن مرد بی‌آنکه درب خانه را قفل کند، برای تدارک خواسته‌ی آن دختر منزلش را ترک کرد و پس از آنکه بازگشت، دید که آن دختر خانه‌اش را ترک نموده و رفته است؛ از این رو آن مرد بیچاره که به شدت دل به آن دختر بسته بود، به قدری رنجور و غمگین شد که همواره در هر کوی و برزن از او یاد می‌کرد و این چنین خود را رسوای کوچه و خیابان نمود که می‌گفت:'
                      'يا رب قائلة يوماً وقد تعبت'
                      'كيف الطريق إلى حمام منجاب'
                      'ترجمه: «آه و افسوس از آن دختری که در حال خستگی، سراغ حمام را گرفت (و من به او دست نیافتم)»!.'
                'یک روز که این رسوای هر کوی و برزن در حال خواندن این بیت بود، صدای دختری را از پسِ پنجره‌ای شنید که می‌گفت'':پ'
                'هلا جعلت سريعاً إذا ظفرت بها'
                'حرزاً على الدار أو قفلا على البابِ'
                'ترجمه:'' «خودت را ملامت و سرزنش کن که چرا وقتی بر او دست یافتی خانه را حفاظت نکردی یا قفلی بر در نزدی»؟!.'
               ' آن شخص با شنیدن این بیت بیش از پیش خراب و دل‌داده شد و سوز و بی‌تابیش به جایی رسید که رو به مرگ نهاد و هم‌چنان از دختر از دست‌داده یاد می‌کرد و بدون گفتن شهادتین از دنیا رفت'

                     '\n'
                      '\n'
                      '\n'
                      '.................................'
                      '\n'
                    'چنین داسان‌هایی را بنگرید در کتاب: العاقبه، ص 171 به بعد'
                      '\n'
                      '\n'
                      '\n'
                         """
حافظ ابن کثیر رحمه الله ضمن بیان رخ‌داده‌های سال 278 ھ ق به بیان وفات شخصی به نام ابن عبدالرحیم می‌پردازد و می‌گوید: ابن جوزی رحمه الله آورده است که: این بدبخت از مجاهدانی بود که در جنگ با رومیان شرکت داشت، در یکی از این نبردها که مسلمانان یکی از سرزمین‌های رومی را به محاصره‌ی خود درآورده بودند، نگاه این شخص به زنی رومی افتاد که بالای یکی از قلعه‌ها بود و بدین‌سان هوای آن زن را کرد و برایش پیام داد که چگونه می‌توانم به تو برسم؟ آن زن نیز در پاسخش گفت: شرطش این است که نصرانی شوی؛ در این صورت می‌توانی نزد من بیایی. آن سیه‌بخت خواسته‌ی زن رومی را پذیرفت، از این رو مسلمانان بسیار اندوهگین و ناراحت شدند و پس از مدتی که او را در کنار آن زن یافتند، از او پرسیدند:‌ای فلانی! قرآنی که حفظ بودی، چه شد؟! آن همه علم و دانشی که داشتی چه شد؟! روزه‌هایی که گرفتی چه شد؟! جهادی که در راه خدا کردی چه شد؟ آن همه نمازی که خواندی چه شد؟! وی در جواب چنین گفت: بدانید که من تمام قرآن را از یاد برده‌ام جز این آیه را که می‌گوید:"""
                         '﴿رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ٢ ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ٣﴾ [الحجر: 2-3].'
                      '«بارها و بارها کافران آرزو می‌کنند کاش مسلمان بودند؛ بگذار بخورند و بهره‌ور شوند و آرزو آنان را غافل سازد؛ بالاخره خواهند دانست' '(''که چه کار بدی کرده‌اند که تنها به دنیا پرداخته و آخرت را فراموش نموده‌اند)».'
                    'و اینک من در میان این‌ها صاحب مال و فرزند شده‌ام( ).'
                'معنای آیه از این قرار است:'
               ' می‌بینید که شهوت‌رانی و پیروی از هوای نفس با انسان چه می‌کند؟''! نمونه‌های بسیاری از این دست وجود دارد که اینجا جای بیان آن نیست؛ به هرحال از تمام دختران و پسران گرامی می‌خواهیم'':'" که همواره از چنین سرنوشتی بترسند"
                    '\n'
                        '\n'
                        '\n'
                            '...................................'
                      '\n'
                          ' ر. ک: البدایه والنهایه، ج 11، ص 64-',

                    style: TextStyle(
                      fontFamily: 'NotoNastaliqUrdu',
                      fontSize: 20,
                      color: Colors.black,
                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );
  }
}