
import 'package:flutter/material.dart';

class second extends StatelessWidget {


  @override
  Widget build(BuildContext context) {

    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text(' ماندگاری پاک‌دامنان در بهشت و برخورداری از نعمت‌های همیشگی آن'),
        backgroundColor: Colors.teal,
      ),
      body: SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,

          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 1700,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 19, right: 8),
                  child: Text(''
                     'خدای متعال به افراد پاک‌دامنی که شرمگاه‌های خود را از بدی بدکاری حفظ می‌کنند، نوید بهشت و ماندگاری در آن را داده و فرموده است.'
                  '﴿أُوْلَٰٓئِكَ هُمُ ٱلۡوَٰرِثُونَ١٠ ٱلَّذِينَ يَرِثُونَ ٱلۡفِرۡدَوۡسَ هُمۡ فِيهَا خَٰلِدُونَ١١﴾ [المؤمنون: 10-11].'
                  '«آنان مستحق و به ارث‌برنده‌ی بهشت هستند؛ کسانی که بهشت برین را تملک می‌کنند و جاودانه در آن می‌مانند».'
                  'پیامبر گرامی اسلام ج که هیچ‌گاه از روی هوا و هوس سخن نگفته، از وعده و نوید راستینی خبر داده و فرموده است:'
                  '«مَنْ يَضْمَنْ لِي مَا بَيْنَ لَحْيَيْهِ وَمَا بَيْنَ رِجْلَيْهِ أَضْمَنْ لَهُ الجَنَّةَ»''( ). یعنی:'' «هرکس به من ضمانت دهد که زبان و شرمگاهش را حفظ کند، من نیز برایش بهشت را ضمانت می‌کنم».'
               ' از این رو اگر خویشتن را از حرام باز دارید و اعضای بدنتان را از آلوده‌شدن به گناه پاش بدارید، نوید الهی در باره‌ی شما تحقق می‌یابد؛ چرا که ضمانت بهشت و شایستگی برخورداری از نعمت‌های آن برای چنین افرادی وعده‌ی شخص معصومی است که از روی هوا و هوس سخن نمی‌گفته است''. مگر شما در پی چیزی گران‌بهاتر و ارزشمندتر از بهشت هستید؟ اگر از عالمی که تمام وقتش را در علم و آموزش می‌گذراند و از عبادت‌گزاری که در عبادت خدایش می‌کوشد و از مجاهدی که جانبش را در راه خدا قربانی می‌کند و از کسی که برای پیروزی حق و نابودی باطل جان‌فشانی می‌نماید و نیز از دعوت‌گری که شب و روز در عرصه‌ی دعوت و روشن‌گری تلاش می‌کند و تمام نشست و برخاستش به خاطر دعوت و در اندیشه‌ی دعوت است، بپرسید که چرا چنین می‌کنند، از آنان پاسخ خواهید شنید که ما در پی رسیدن به بهشت هستیم'
               ' آری! بهشت و برخورداری از نعمت‌های جاویدانش خواسته و هدف یکا یک فعالان دینی است؛ هرچند که راه‌های آنان برای رسیدن به این مقصود، متنوع و گوناگون می‌باشد'
                ' از این رو‌ای برادر گرامی و‌ای خواهر بزرگوار! اعضای بدنتان را آلوده‌شدن به حرام حفظ کنید تا سزاوار برخورداری'
                      ' از این نوید راستین پیامبر'
                      ' اکرم صلی الله علیه وسلم شوید'
                      ' ',

                    style: TextStyle(
                      fontFamily: 'NotoNastaliqUrdu',
                      fontSize: 20,
                      color: Colors.black,

                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );
  }
}