
import 'package:flutter/material.dart';

class thirt extends StatelessWidget {


  @override
  Widget build(BuildContext context) {

    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text('آرامش و آسودگی‌خاطر'),
        backgroundColor: Colors.teal,
      ),
      body: SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,

          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 1400,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 15,right: 8),
                  child: Text(''

                    'کسانی که در پی شهوت حرام و پاسخ‌گویی به نیازهای جنسی خود از راه‌های نامشروع هستند، همواره از عذاب روحی و جهنم گونه‌ای رنج می‌برند و برعکس آنان که راه عفت و پاک‌دامنی در پیش می‌گیرند، در زندگی از نعمت آرامش و آسودگی‌خاطر بهره‌مند می‌شوند، زیرا خواسته‌ای که آنان را به خود مشغول می‌کند با خواسته‌های دیگران تفاوت دارد و فکر و اندیشه‌ای که بر آنان سیطره می‌یابد، فکر و اندیشه‌ی‌سیطره یافته بر دیگر مردمان نیست و اصلاً تفاوت خواسته‌ها و اندیشه‌های پاک‌دامنان با دیگران مسأله‌ی عجیبی نمی‌باشد، زیرا خدای متعال انسان را آفریده و به مصالح بشر داناتر است؛ پروردگار بلندمرتبه انسان را برای اطاعت و عبادت خویش آفریده و از این رو انسان تا زمانی که در مسیر اطاعت و بندگی خدا قرار نگیرد، زندگی آرام و آسوده‌ای نخواهد داشت، چنانچه حرکت اتومبیلی که برای جاده‌های آسفالت ساخته شده، در دیگر جاده‌ها با مشکل مواجه می‌شود؛ همچنین اگر قطاری که برای حرکت بر روی خط آهن ساخته شده، از مسیرش منحرف شود، دیگر نمی‌تواند به راهش ادامه دهد. انسان نیز این چنین است و برای عبادت و بندگی خدا آفریده شده است؛ از این رو اگر از مسیر اصلی زندگانیش که همان بندگی خداست منحرف گردد، با اضطراب و پریشانی مواجه خواهد شد و از مشکلات بسیاری رنج خواهد برد. بدین‌سان می‌بینیم که کافران و بی‌دینان کم‌تر از نعمت آرامش روحی برخوردارند. شکی نیست که هرچه بنده به ایمان و بنندگی نزدیک‌تر شود، بیشتر به آرامش و آسودگی‌خاطر دست می‌یابد'
                      '\n'
                      '\n'
                      '\n'
                      '---------------------------------------------------'
                      '\n'

                    ' - روایت بخاری، حدیث شماره‌ی (6474)؛ روایت ترمذی، حدیث (2408)',
                    style: TextStyle(
                      fontFamily: 'NotoNastaliqUrdu',
                      fontSize: 20,
                      color: Colors.black,
                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );


  }
}