
import 'package:flutter/material.dart';

class Dosthamnishin extends StatelessWidget {


  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.green[100],
      appBar: AppBar(
        title: Text('دوست و هم‌نشین بد'),
        backgroundColor: Colors.teal,
      ),
      body:SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,
          children: [
            Padding(
              padding: const EdgeInsets.all(15),
              child: Container(
                height: 3200,
                width: 500,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(20),
                  color: Colors.white54,
                ),
                child: Padding(
                  padding: const EdgeInsets.only(left: 15 , right: 6),
                  child: Text(''
                         'ای خواهران و برادران گرامی! یکایک دوستانتان را مورد ملاحظه قرار دهید و بنگرید که آیا در میان آن‌ها چنان کسی هست که در روز قیامت از دوستی با او اظهار ندامت و پشیمانی کنید و بگویید:'
                  '﴿يَٰوَيۡلَتَىٰ لَيۡتَنِي لَمۡ أَتَّخِذۡ فُلَانًا خَلِيلٗا٢٨﴾ [الفرقان: 28].'
                  '«ای کاش! من فلانی را به دوستی نمی‌گرفتم».'
                 ' هم‌چنین توجه کنید که آیا همه‌ی دوستان شما چنان هستند که دوست داشته باشید تا در روز قیامت با آنان برانگیخته شوید؟ چرا که رسول الله صلی الله علیه وسلم فرموده است'': «الـمـَرْءُ مَعَ مَنْ أَحَبَّ»( ). یعنی: «هرشخصی با کسی خواهد بود که او را دوست می‌دارد»''. نیز باید توجه داشته باشید که آیا از چند و چون دین و دین‌داری تمام دوستانتان راضی هستید یا نه؟ این فرموده‌ی رسول خدا ج از شما پوشیده نماند که'': «الْـمَرْءُ عَلَى دِينِ خَلِيلِهِ، فَلْيَنْظُرْ أَحَدُكُمْ مَنْ يُخَالِلُ»''( ). یعنی: «هرشخصی بر دین دوستش می‌باشد؛ از این رو هریک از شما بنگرد که با چه کسی دوستی می‌کند»''.'
              'البته در این چارچوب باید بنگرید که دوستان شما از کدامین گروه هستند؟ از عطاران و دارندگان مشک و خوش‌بویی یا از آهن‌گران و دمندگان دمه‌ی آهن‌گر؟!'' شما فرموده‌ی رسول خدا ج را شنیده‌اید که:'' «مَثَلُ الجَلِيسِ الصَّالِحِ وَالسَّوْءِ، كَحَامِلِ المِسْكِ وَنَافِخِ الكِيرِ»( ). یعنی:'' «مثال هم‌نشین خوب و بد مانند، حامل مشک و دمنده‌ی دمه‌ی آهن‌گر است».'
      'می‌دانیم که دوستان و هم‌نشینان اثرگذاری زیادی بر رفتار و منش انسان دارند؛ این اثر گذاری در دوران جوانی بیش‌تر و نمایان‌تر است؛ در این دوران است که بسیاری از افراد توسط دوستانشان به انحراف و منجلاب فساد کشیده می‌شوند''. در مجله‌ی کویتی الأنبیاء گزارشی آمده است که به نقل از جوانی ''17 ساله چنین می‌گوید'': «چند سال پیش که به دیدن یکی از دوستانم رفته بودم، برای نخستین بار فیلم‌های مبتذل دیدم؛ دوستم در اتاقش فیلم داشت؛ او برایم فیلم گذاشت و...».'
      'تا آنجا که من سراغ دارم'': سرآغاز روابط نامشروع بسیاری از دختران با پسرها از سوی آن دسته از دوستانشان بوده که به نحوی با پسرها رابطه داشته‌اند؛ بدین ترتیب که عکس پسری جوان را از دوستشان دریافت کرده‌اند و این چنین راه برقراری ارتباط با پسرها برایشان فراهم شده است''.'
      'زمانی که انسان دست از معصیت بکشد، بازهم دوستان بد دست از سر آدم برنمی‌دارند''. یکی از افرادی که در ریاض پس از آزادی از دار التأدیب دوباره به آن باز گردانده شده بود، می‌گوید'': «سبب بازگشت دوباره‌ی من به اینجا این بود که خیلی زود به گذشته‌ی تباهم دچار شدم و به سراغ دوستان بد و همان ریسمان پوسیده‌ی پیشین رفتم، زیرا هربار که از اینجا بیرون می‌رفتم، دوستانم را می‌دیدم که به انتظارم ایستاده‌اند و مرا به کارها و مشکلاتی که قبلاً داشته‌ام فرا می‌خوانند؛ آنان بدی‌ها را برایم می‌آراستند و خوبی‌ها را در چشمم بد و زشت نشان می‌دادند، این کارشان سبب شد تا ندامت از بدی‌ها و نیز عزم پایداری در راه پشیمانی را از یاد ببرم و بدین‌سان دوباره به کنون برگردم»''.'
      'آنگونه که برخی می‌پندارند'': دوستان بد همیشه از کسانی که در کانون‌های اصلاحی و یا زندان‌ها باهم هستند نمی‌باشند؛ نیز برخلاف تصور برخی دیگر دوستان ناباب فقط افراد معتاد نیستند؛ بلکه هرکسی که بدی‌ها را در چشم دوستش بیاراید و یا خوبی را زشت نشان دهد، دوست ناباب و هم‌نشین بدی است''. چنین فردی می‌تواند از نزدیکان و اقوام انسان و حتی برادر تنی آدم باشد''! از این رو از قطع‌رابطه‌ی تدریجی با دوست ناباب بپرهیزید و هرچه زودتر با او قطع‌رابطه نمایید؛ اگر امروز به بدی دوستتان پی بردید، دیگر شایسته نیست که فردا او را ببینید و برای قطع‌رابطه با او امروز و فردا نمایید، کسی که در قطع رابطه با دوست بد درنگ می‌کند، به کسی می‌ماند که مشغول خوردن غذای فاسد است و چون از خرابی غذا باخبر می‌شود، می‌خواهد برای کنارگذاشتن غذای فاسد به جای سه لقمه‌ای که قبلاً می‌خورده، دو لقمه بخورد''!.'
      'آری!'' چنین رویه‌ای برای این فرد زیان‌بار است؛ البته کسی که در ترک دوستی با هم‌نشین بد درنگ می‌کند، خیلی بیش‌تر از شخصی ضرر و زیان می‌بیند که غذای فاسد را به صورت تدریجی کنار می‌گذارد'
                      '\n'
                      '\n'
                      '\n'
                      '......................................................'
                      '\n'
                      '  روایت بخاری، حدیث (6168)؛ مسلم (2641)'
                      ' - روایت احمد، حدیث: (8212)؛ ابوداود: (4833) و ترمذی: (2378)'
          ' رواه البخاری (5534) و مسلم (2628)',


                    style: TextStyle(
                      fontFamily: 'Tajawal',
                      fontSize: 18,
                      color: Colors.black,
                    ),
                    textAlign: TextAlign.end,
                  ),
                ),
              ),
            ),
          ],
        ),

      ),
    );


  }
}